// Regular Expression (RegEx) - регулярки
/*
  Мова пошуку тексту по шаблонам

  Засновані на використанні метасимволів

  Регулярка кладається з 2 частин:
    - шаблон пошуку - описує що шукаємо
    - пропорції - налаштування / параметри регулярки

    /шаблон/пропорції
*/

/*
  Шаблони:
    /text/ - шукає слово

  Метасимволи шаблонів:
    . - будь-який один символ
    \ - екранування спеціального символа (наприклад: \.)
*/

/*
  [ab1v9] - пошук одного символа з перелічених у середині дужок (крапка всередині вважається звичайним символом)

  [a-z] - вказання одного символа з діапазону (Юнікод)

  [A-Za-z] - вказання декількох діапазонів одночасно

  [^a-z] - пошук усіх символів окрім тих, що в дужках
*/

/*
  Квантифікатори = частинка регулярки, яка довзволяє сказати скільки разів треба повторити частину шаблона, яка іде прямо перед квантифікатором

  [0-9]{3} - пошук трьох цифр

  [0-9]{2,5} - пошук від 2 до 5 цифр

  [0-9]{2,} - пошук від 2 до бескінечності цифр

  [0-9]{0,7} - пошук від 0 до 7 цифр


  або є, або немає:
    X{0,1}
    X?
  від нуля до нескінченності:
    X{0,}
    X*
    .* - будь-яка кількітсть будь-яких символів
  від 1 до нескінченності:
    X{1,}
    X+
*/
