/*
  DOM:
    Document
    Object
    Model
  - обʼєктна модель документа

  Отримати доступ до DOM:
    window - обʼєктне уявлення браущера

    window.document - вхідна точка в API DOM
    document
*/
console.log(document)

/*
  концепції взаємодії з DOM:
    1. Все у DOM зроблено і вигляді обʼєктів
    2. Маємо можливість казати DOMу, що ми хочемо зробити за допомогою подій
*/

/*
  При натисканні на кнопку вивести алертом повідомлення

  1. Треба знайти кнопку
  2. Написати що саме ми хочемо щоб сталося при натисканні на кнопку
  3. Кнопці з пункту 1 сказати що коли на неї клікають вона має запустити код в пункту 2
*/

// 1. Треба знайти кнопку
const buttons = document.getElementsByTagName('button')
const [clickMeBtn] = buttons

// 2. Написати що саме ми хочемо щоб сталося при натисканні на кнопку
function showMessage() {
  alert('You clicked on button')
}

// 3. Кнопці з пункту 1 сказати що коли на неї клікають вона має запустити код в пункту 2

// target.addEventListener(type, listener)
/*
  target - той, з ким відбудеться подія
  type - рядок, який каже яка саме подія має трапитись
  listener - функція, яка запуститься браузером коли подія відбудеться з target
*/

clickMeBtn.addEventListener('click', showMessage)